; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-19)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city22)
	(fuel-level plane1 fl0)
	(at plane2 city0)
	(fuel-level plane2 fl0)
	(at plane3 city11)
	(fuel-level plane3 fl6)
	(at person1 city4)
	(at person2 city9)
	(at person3 city16)
	(at person4 city16)
	(at person5 city11)
	(at person6 city1)
	(at person7 city16)
	(at person8 city10)
	(at person9 city8)
	(at person10 city5)
	(at person11 city15)
	(at person12 city17)
	(at person13 city4)
	(at person14 city4)
	(at person15 city13)
	(at person16 city10)
	(at person17 city3)
	(at person18 city9)
	(at person19 city9)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city6)
	(at person2 city4)
	(at person4 city7)
	(at person5 city22)
	(at person6 city3)
	(at person7 city5)
	(at person8 city14)
	(at person9 city6)
	(at person10 city21)
	(at person11 city3)
	(at person12 city13)
	(at person13 city6)
	(at person16 city13)
	(at person17 city6)
	(at person18 city17)
	(at person19 city3)
	))

)

; plan
1. (zoom plane3 city11 city9 fl6 fl5 fl4)
   deleted: (at plane3 city11) (fuel-level plane3 fl6)
   added: (at plane3 city9) (fuel-level plane3 fl4)
   goals met: 0 of 16
2. (board person2 plane3 city9)
   deleted: (at person2 city9)
   added: (in person2 plane3)
   goals met: 0 of 16
3. (board person19 plane3 city9)
   deleted: (at person19 city9)
   added: (in person19 plane3)
   goals met: 0 of 16
4. (board person18 plane3 city9)
   deleted: (at person18 city9)
   added: (in person18 plane3)
   goals met: 0 of 16
5. (zoom plane3 city9 city4 fl4 fl3 fl2)
   deleted: (at plane3 city9) (fuel-level plane3 fl4)
   added: (at plane3 city4) (fuel-level plane3 fl2)
   goals met: 0 of 16
6. (debark person2 plane3 city4)
   deleted: (in person2 plane3)
   added: (at person2 city4)
   goals met: 1 of 16
7. (board person13 plane3 city4)
   deleted: (at person13 city4)
   added: (in person13 plane3)
   goals met: 1 of 16
8. (board person1 plane3 city4)
   deleted: (at person1 city4)
   added: (in person1 plane3)
   goals met: 1 of 16
9. (fly plane3 city4 city1 fl2 fl1)
   deleted: (at plane3 city4) (fuel-level plane3 fl2)
   added: (at plane3 city1) (fuel-level plane3 fl1)
   goals met: 1 of 16
10. (board person6 plane3 city1)
   deleted: (at person6 city1)
   added: (in person6 plane3)
   goals met: 1 of 16
11. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 1 of 16
12. (fly plane2 city0 city10 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 1 of 16
13. (board person8 plane2 city10)
   deleted: (at person8 city10)
   added: (in person8 plane2)
   goals met: 1 of 16
14. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 1 of 16
15. (board person16 plane2 city10)
   deleted: (at person16 city10)
   added: (in person16 plane2)
   goals met: 1 of 16
16. (fly plane2 city10 city13 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 1 of 16
17. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 1 of 16
18. (debark person16 plane2 city13)
   deleted: (in person16 plane2)
   added: (at person16 city13)
   goals met: 2 of 16
19. (fly plane3 city1 city3 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 2 of 16
20. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 2 of 16
21. (debark person6 plane3 city3)
   deleted: (in person6 plane3)
   added: (at person6 city3)
   goals met: 3 of 16
22. (debark person19 plane3 city3)
   deleted: (in person19 plane3)
   added: (at person19 city3)
   goals met: 4 of 16
23. (board person17 plane3 city3)
   deleted: (at person17 city3)
   added: (in person17 plane3)
   goals met: 4 of 16
24. (fly plane3 city3 city6 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 4 of 16
25. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 16
26. (debark person17 plane3 city6)
   deleted: (in person17 plane3)
   added: (at person17 city6)
   goals met: 5 of 16
27. (debark person13 plane3 city6)
   deleted: (in person13 plane3)
   added: (at person13 city6)
   goals met: 6 of 16
28. (debark person1 plane3 city6)
   deleted: (in person1 plane3)
   added: (at person1 city6)
   goals met: 7 of 16
29. (fly plane3 city6 city17 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city17) (fuel-level plane3 fl0)
   goals met: 7 of 16
30. (debark person18 plane3 city17)
   deleted: (in person18 plane3)
   added: (at person18 city17)
   goals met: 8 of 16
31. (board person12 plane3 city17)
   deleted: (at person12 city17)
   added: (in person12 plane3)
   goals met: 8 of 16
32. (refuel plane3 city17 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 16
33. (fly plane2 city13 city11 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 8 of 16
34. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 16
35. (board person5 plane2 city11)
   deleted: (at person5 city11)
   added: (in person5 plane2)
   goals met: 8 of 16
36. (fly plane2 city11 city14 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 8 of 16
37. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 16
38. (debark person8 plane2 city14)
   deleted: (in person8 plane2)
   added: (at person8 city14)
   goals met: 9 of 16
39. (fly plane2 city14 city15 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 9 of 16
40. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 16
41. (board person11 plane2 city15)
   deleted: (at person11 city15)
   added: (in person11 plane2)
   goals met: 9 of 16
42. (fly plane2 city15 city22 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city22) (fuel-level plane2 fl0)
   goals met: 9 of 16
43. (refuel plane2 city22 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 16
44. (debark person5 plane2 city22)
   deleted: (in person5 plane2)
   added: (at person5 city22)
   goals met: 10 of 16
45. (fly plane2 city22 city16 fl1 fl0)
   deleted: (at plane2 city22) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 10 of 16
46. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 16
47. (fly plane3 city17 city13 fl1 fl0)
   deleted: (at plane3 city17) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 10 of 16
48. (debark person12 plane3 city13)
   deleted: (in person12 plane3)
   added: (at person12 city13)
   goals met: 11 of 16
49. (board person7 plane2 city16)
   deleted: (at person7 city16)
   added: (in person7 plane2)
   goals met: 11 of 16
50. (board person4 plane2 city16)
   deleted: (at person4 city16)
   added: (in person4 plane2)
   goals met: 11 of 16
51. (fly plane2 city16 city5 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 11 of 16
52. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 16
53. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 16
54. (debark person7 plane2 city5)
   deleted: (in person7 plane2)
   added: (at person7 city5)
   goals met: 12 of 16
55. (board person10 plane2 city5)
   deleted: (at person10 city5)
   added: (in person10 plane2)
   goals met: 12 of 16
56. (fly plane3 city13 city8 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 12 of 16
57. (board person9 plane3 city8)
   deleted: (at person9 city8)
   added: (in person9 plane3)
   goals met: 12 of 16
58. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 16
59. (fly plane3 city8 city6 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 12 of 16
60. (debark person9 plane3 city6)
   deleted: (in person9 plane3)
   added: (at person9 city6)
   goals met: 13 of 16
61. (fly plane2 city5 city21 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city21) (fuel-level plane2 fl0)
   goals met: 13 of 16
62. (refuel plane2 city21 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 16
63. (debark person10 plane2 city21)
   deleted: (in person10 plane2)
   added: (at person10 city21)
   goals met: 14 of 16
64. (fly plane2 city21 city3 fl1 fl0)
   deleted: (at plane2 city21) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 14 of 16
65. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 16
66. (debark person11 plane2 city3)
   deleted: (in person11 plane2)
   added: (at person11 city3)
   goals met: 15 of 16
67. (fly plane2 city3 city7 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 15 of 16
68. (debark person4 plane2 city7)
   deleted: (in person4 plane2)
   added: (at person4 city7)
   goals met: 16 of 16
